"Western (Mac OS Roman)" = "西文（Mac OS Roman）";
"Japanese (Mac OS)" = "日文（Mac OS）";
"Traditional Chinese (Mac OS)" = "繁体中文（Mac OS）";
"Korean (Mac OS)" = "韩文（Mac OS）";
"Arabic (Mac OS)" = "阿拉伯文（Mac OS）";
"Hebrew (Mac OS)" = "希伯来文（Mac OS）";
"Greek (Mac OS)" = "希腊文（Mac OS）";
"Cyrillic (Mac OS)" = "西里尔文（Mac OS）";
"Devanagari (Mac OS)" = "天城文（Mac OS）";
"Gurmukhi (Mac OS)" = "果鲁穆奇文（Mac OS）";
"Gujarati (Mac OS)" = "古吉拉特文（Mac OS）";
"Thai (Mac OS)" = "泰文（Mac OS）";
"Simplified Chinese (Mac OS)" = "简体中文（Mac OS）";
"Tibetan (Mac OS)" = "藏文（Mac OS）";
"Central European (Mac OS)" = "中欧语系（Mac OS）";
"Symbol (Mac OS)" = "符号（Mac OS）";
"Dingbats (Mac OS)" = "花饰（Mac OS）";
"Turkish (Mac OS)" = "土耳其文（Mac OS）";
"Croatian (Mac OS)" = "克罗地亚文（Mac OS）";
"Icelandic (Mac OS)" = "冰岛文（Mac OS）";
"Romanian (Mac OS)" = "罗马尼亚文（Mac OS）";
"Celtic (Mac OS)" = "凯尔特文 (Mac OS)";
"Gaelic (Mac OS)" = "盖尔文 (Mac OS)";
"Keyboard Symbols (Mac OS)" = "键盘符号（Mac OS）";
"Farsi (Mac OS)" = "波斯文 (Mac OS)";
"Cyrillic (Mac OS Ukrainian)" = "西里尔文（Mac OS Ukrainian）";
"Inuit (Mac OS)" = "因纽特文 (Mac OS)";
"Unicode (UTF-16)" = "Unicode (UTF-16)";
"Unicode (UTF-7)" = "Unicode (UTF-7)";
"Unicode (UTF-8)" = "Unicode (UTF-8)";
"Unicode (UTF-32)" = "Unicode (UTF-32)";
"Unicode (UTF-16BE)" = "Unicode (UTF-16BE)";
"Unicode (UTF-16LE)" = "Unicode (UTF-16LE)";
"Unicode (UTF-32BE)" = "Unicode (UTF-32BE)";
"Unicode (UTF-32LE)" = "Unicode (UTF-32LE)";
"Western (ISO Latin 1)" = "西文（ISO Latin 1）";
"Central European (ISO Latin 2)" = "中欧语系（ISO Latin 2）";
"Western (ISO Latin 3)" = "西文（ISO Latin 3）";
"Central European (ISO Latin 4)" = "中欧语系（ISO Latin 4）";
"Cyrillic (ISO 8859-5)" = "西里尔文（ISO 8859-5）";
"Arabic (ISO 8859-6)" = "阿拉伯文（ISO 8859-6）";
"Greek (ISO 8859-7)" = "希腊文（ISO 8859-7）";
"Hebrew (ISO 8859-8)" = "希伯来文（ISO 8859-8）";
"Turkish (ISO Latin 5)" = "土耳其文（ISO Latin 5）";
"Nordic (ISO Latin 6)" = "北日耳曼文（ISO Latin 6）";
"Thai (ISO 8859-11)" = "泰文（ISO 8859-11）";
"Baltic (ISO Latin 7)" = "波罗的海文 (ISO Latin 7)";
"Celtic (ISO Latin 8)" = "凯尔特文（ISO Latin 8）";
"Western (ISO Latin 9)" = "西文（ISO Latin 9）";
"Romanian (ISO Latin 10)" = "罗马尼亚文 (ISO Latin 10)";
"Latin-US (DOS)" = "美国拉丁文（DOS）";
"Greek (DOS)" = "希腊文（DOS）";
"Baltic (DOS)" = "波罗的海文 (DOS)";
"Western (DOS Latin 1)" = "西文（DOS Latin 1）";
"Greek (DOS Greek 1)" = "希腊文 (DOS Greek 1)";
"Central European (DOS Latin 2)" = "中欧语系（DOS Latin 2）";
"Cyrillic (DOS)" = "西里尔文（DOS）";
"Turkish (DOS)" = "土耳其文（DOS）";
"Portuguese (DOS)" = "葡萄牙文 (DOS)";
"Icelandic (DOS)" = "冰岛文（DOS）";
"Hebrew (DOS)" = "希伯来文 (DOS)";
"Canadian French (DOS)" = "加拿大法文 (DOS)";
"Arabic (DOS)" = "阿拉伯文（DOS）";
"Nordic (DOS)" = "北欧日耳曼文 (DOS)";
"Russian (DOS)" = "俄文 (DOS)";
"Greek (DOS Greek 2)" = "希腊文 (DOS Greek 2)";
"Thai (Windows, DOS)" = "泰文（Windows, DOS）";
"Japanese (Windows, DOS)" = "日文（Windows, DOS）";
"Simplified Chinese (Windows, DOS)" = "简体中文（Windows, DOS）";
"Korean (Windows, DOS)" = "韩文（Windows, DOS）";
"Traditional Chinese (Windows, DOS)" = "繁体中文（Windows, DOS）";
"Western (Windows Latin 1)" = "西文（Windows Latin 1）";
"Central European (Windows Latin 2)" = "中欧语系（Windows Latin 2）";
"Cyrillic (Windows)" = "西里尔文（Windows）";
"Greek (Windows)" = "希腊文（Windows）";
"Turkish (Windows Latin 5)" = "土耳其文（Windows Latin 5）";
"Hebrew (Windows)" = "希伯来文（Windows）";
"Arabic (Windows)" = "阿拉伯文（Windows）";
"Baltic (Windows)" = "波罗的海文 (Windows)";
"Vietnamese (Windows)" = "越南文（Windows）";
"Western (ASCII)" = "西文（ASCII）";
"Japanese (Shift JIS X0213)" = "日文（Shift JIS X0213）";
"Chinese (GBK)" = "中文（GBK）";
"Chinese (GB 18030)" = "中文（GB 18030）";
"Japanese (ISO 2022-JP)" = "日文（ISO 2022-JP）";
"Japanese (ISO 2022-JP-2)" = "日文 (ISO 2022-JP-2)";
"Japanese (ISO 2022-JP-1)" = "日文 (ISO 2022-JP-1)";
"Chinese (ISO 2022-CN)" = "中文 (ISO 2022-CN)";
"Korean (ISO 2022-KR)" = "韩文（ISO 2022-KR）";
"Japanese (EUC)" = "日文（EUC）";
"Simplified Chinese (GB 2312)" = "简体中文 (GB 2312)";
"Traditional Chinese (EUC)" = "繁体中文（EUC）";
"Korean (EUC)" = "韩文（EUC）";
"Japanese (Shift JIS)" = "日文（Shift JIS）";
"Cyrillic (KOI8-R)" = "西里尔文（KOI8-R）";
"Traditional Chinese (Big 5)" = "繁体中文（Big 5）";
"Western (Mac Mail)" = "西文（Mac 邮件）";
"Simplified Chinese (HZ GB 2312)" = "简体中文（HZ GB 2312）";
"Traditional Chinese (Big 5 HKSCS)" = "繁体中文（Big 5 HKSCS）";
"Ukrainian (KOI8-U)" = "乌克兰文（KOI8-U）";
"Traditional Chinese (Big 5-E)" = "繁体中文 (Big 5-E)";
"Western (NextStep)" = "西文（NextStep）";
"Non-lossy ASCII" = "无损 ASCII";
"Western (EBCDIC Latin Core)" = "西文 (EBCDIC Latin Core)";
"Western (EBCDIC Latin 1)" = "西文（EBCDIC Latin 1）";
"Japanese (Auto Detect)" = "日文（自动检测）";
